/**
 * Author:   KeeneChen
 * DateTime: 2022.07.19-14:45:31
 * Description: 二维数组定义
 */
#include <stdio.h>

int main(void)
{
    // 初始化一个两行两列的二维数组
    int arr[2][2] = {{1, 2}, {3, 4}};
    // 等价于 int arr[2][2] = {1, 2, 3, 4};

    // 指定位置赋值
    int foo[2][2] = {[0][1] = 1, [1][0] = 2};
    // 等价于 int foo[2][2] = {0, 1, 1, 0};

    // 如果花括号中的值少于数组大小会自动赋值为0
    int bar[2][2] = {1, 2, 3};
    // 等价于 int bar[2][2] = {1, 2, 3, 0};

    // 二维数组定义时行可以省略但是列不能
    int baz[][2] = {1, 2, 3};

    return 0;
}
