#include "config.h"
#include "menu/menu.h"
#include "tools/hint.h"
#include "tools/color.h"
#include <stdio.h>
#include <stdlib.h>

const int option_num[MENU_NUM] = {4, 7, 4, 6, 6, 4, 4, 4};

// 不同菜单的视觉提示
static const char *MenuPrompts[MENU_NUM] = {"\
+============+============+==============+========+\n\
| 1.用户登录 | 2.用户注册 | 3.管理员登录 | 4.退出 |\n\
+============+============+==============+========+\n",
                                            "\
+========+========+========+========+========+=======+==============+\n\
| 1.商品 | 2.搜索 | 3.订单 | 4.用户 | 5.删除 | 6.Ban | 7.返回上一级 |\n\
+========+========+========+========+========+=======+==============+\n",
                                            "\
+========+========+========+==============+\n\
| 1.卖家 | 2.买家 | 3.详情 | 4.返回上一级 |\n\
+========+========+========+==============+\n",
                                            "\
+========+========+========+========+========+==============+\n\
| 1.商品 | 2.购买 | 3.搜索 | 4.订单 | 5.详情 | 6.返回上一级 |\n\
+========+========+========+========+========+==============+\n",
                                            "\
+========+========+========+=======+========+==============+\n\
| 1.买家 | 2.商品 | 3.修改 | 4.Ban | 5.订单 | 6.返回上一级 |\n\
+========+========+========+=======+========+==============+\n",
                                            "\
+===============+==========+==========+========+\n\
| 1.详情 | 2.修改 | 3.充值 | 4.返回上一级 |\n\
+===============+==========+==========+========+\n",
                                            "\
+========+============+========+==============+\n\
| 1.密码 | 2.联系方式 | 3.地址 | 4.返回上一级 |\n\
+========+============+========+==============+\n",
                                            "\
+========+========+========+==============+\n\
| 1.名称 | 2.价格 | 3.描述 | 4.返回上一级 |\n\
+========+========+========+==============+\n"};

static const char *MenuNames[MENU_NUM] = {"主", "管理员", "用户", "卖家", "买家", "详情", "修改", "商品"};

/**
 * @brief 打印菜单提示消息
 * @param type 菜单类型
 */
static void PromptMessage(Menu type)
{
    printf("\t\t\t%s%s菜单%s\n", REVERSE, MenuNames[type], RESET);
    printf("%s\n请选择您的操作: ", MenuPrompts[type]);
}

int menu(Menu type)
{
    PromptMessage(type);
    char buffer[MAX_SIZE];
    int res;
    scanf("%s", buffer);
    res = atoi(buffer);
    while (1)
    {
        if (res >= 1 && res <= option_num[type])
            break;
        IllegalMessage();
        printf("请重新选择: ");
        scanf("%s", buffer);
        res = atoi(buffer);
    }
    return res;
}
